app/Controllers/Authentification.php

  public function connexion()
  {

    $matricule = strtoupper('' . $this->request->getPost('login'));
    $mot_de_passe = sha1(''.$this->request->getPost('mdp'));

    $model = new ModelUtilisateur();

    $utilisateur = $model->where([
      'matricule' => $matricule,
      'mot_de_passe' => $mot_de_passe,
    ])->first();
---
SELECT *
FROM `utilisateurs`
WHERE `matricule` = 'TAL007'
AND `mot_de_passe` = '83f2dd788822a3803e2c63c50253952c04f498a5'
 LIMIT 1